import { makeAutoObservable } from "mobx"

export default class RegistrationInfo {
    news = [
        {
            image:'',
            head:'Патч 0.0.1',
            paragraph:'Патч 0.0.1 самое первое,даже не обновление,а скорее полный ремейк нашего предыдущего сайта,который я искренне хотел сделать удобнее красивее и самое главное,функциональнее.Разработка наших проектов идет полным ходом,так что ждите новостей',
            data:'1669907657075',
        },
        {
            image:'',
            head:'Патч 0.0.2',
            paragraph:'Патч 0.0.1 самое первое,даже не обновление,а скорее полный ремейк нашего предыдущего сайта,который я искренне хотел сделать удобнее красивее и самое главное,функциональнее.Разработка наших проектов идет полным ходом,так что ждите новостей',
            data:'1669907657075',
        },
        {
            image:'',
            head:'Патч 0.0.3',
            paragraph:'Патч 0.0.1 самое первое,даже не обновление,а скорее полный ремейк нашего предыдущего сайта,который я искренне хотел сделать удобнее красивее и самое главное,функциональнее.Разработка наших проектов идет полным ходом,так что ждите новостей',
            data:'1669907657075',
        },
        {
            image:'',
            head:'Патч 0.0.4',
            paragraph:'Патч 0.0.1 самое первое,даже не обновление,а скорее полный ремейк нашего предыдущего сайта,который я искренне хотел сделать удобнее красивее и самое главное,функциональнее.Разработка наших проектов идет полным ходом,так что ждите новостей',
            data:'1669907657075',
        },
    ]
    constructor() {
        makeAutoObservable(this)
    }
}